Repository: 84000/data-translation-memory
Catalog: toh232-v4.tmx
Source language: bo
Languages: en

source: །པད་མ་དེ་དག་རེ་རེ་ལས་དྲི་ངད་བྱུང་བ་གང་ཡིན་པ་དེས་ཀྱང་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་དྲིས་ཁྱབ་པར་གྱུར་ཏོ། །
en: Fragrant smells wafted from each of those lotus flowers, pervading the entire great trichiliocosm world-system with their scent.

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདིའི་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། མི་རྣམས་ཀྱི་སྤོས་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་ཀྱང་པད་མའི་དྲི་དེས་ཁྱབ་པར་གྱུར་ཏོ། །
en: The perfumes of all gods, nāgas, yakṣas, gandharvas, and humans became permeated with that fragrance.

source: ལྷ་དང་། མི་རྣམས་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་རྣམས་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་གང་དག་གིས་སྣར་པད་མའི་དྲི་དེ་སོང་བ་དེ་དག་ཐམས་ཅད་ཀྱང་ཆོས་ཀྱི་དགའ་བ་དང་། ཆོས་མཉན་པའི་རྒྱུ་དང་ལྡན་པར་གྱུར་ཏེ་བདག་ཉིད་ཉོན་མོངས་པ་དང་བྲལ་བ་སྙམ་དུ་ཤེས་སོ།
en: All gods, humans, asuras, garuḍas, nāgas, yakṣas, gandharvas, kinnaras, and mahoragas whose noses were reached by the fragrance of those lotus flowers developed the joy of Dharma and became endowed with the causes for hearing the Dharma, thinking, ‘I myself am free from afflictions.’

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྲིན་ཆེན་སྙིང་པོས་ཆོས་ཀྱི་འོད་ཀྱི་བཀོད་པ་དེ་མཐོང་ནས་ཐལ་མོ་སྦྱར་ཏེ་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འདི་ལྟར་ཕྱོགས་བཅུར་འོད་གདའ་བ་འདི་དང་པད་མའི་བཀོད་པ་བྱུང་བ་འདི་སུའི་སྔ་ལྟས་ལགས།
en: Then the bodhisattva mahāsattva Great Cloud Essence, beholding that array of the light of the Dharma, joined his palms and addressed the Bhagavān, saying, “Bhagavān, the shining forth of this light throughout the ten directions and the emergence of this array of lotus flowers—for whom is this omen intended?”

source: དེ་ནས་ལྷ་མོ་དྲི་མ་མེད་པའི་འོད་ཀྱིས་སྤྲིན་ཆེན་སྙིང་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་སྤྲིན་ཆེན་སྙིང་པོ་ཅིའི་ཕྱིར་བཅོམ་ལྡན་འདས་འདི་སུའི་སྔ་ལྟས་ལགས་ཞེས་སྨྲ།
en: Then the goddess Stainless Light addressed Great Cloud Essence, saying, “Noble Great Cloud Essence, why do you ask the Bhagavān for whom this omen is intended?

source: མཚན་མ་མེད་པའི་ཆོས་རྨི་ལམ་ལྟ་བུ་ཡིན་ཡང་འདྲི་བར་བྱེད་དམ་ཁྱོད་ལ་ནི་ད་དུང་ཡང་ཕྱིན་ཅི་ལོག་ཡོད་པ་འདྲའོ།
en: Phenomena are signless and dreamlike, and yet you ask this question. It seems that you are again mistaken.” “

source: །སྨྲས་པ། ལྷ་མོ་ལེགས་སོ། །ལེགས་སོ།
en: Goddess, excellent, excellent!

source: ལྷ་མོ་ཁྱོད་ལེགས་སོ།
en: Goddess, excellent!

source: །ཁོ་བོ་ནི་རྨི་ལམ་ལྟ་བུའི་ཡུལ་དག་ལ་མཚན་མར་ལྟ་བ་འཛིན་པའི་འདུ་ཤེས་བཅོམ་ལྡན་འདས་ལ་ཞུ་བར་བྱེད་དོ། །
en: It is according to the perception that apprehends dreamlike objects according to the view that they possess signs that I ask the Bhagavān.” “

source: སྨྲས་པ། འཕགས་པ་སྤྲིན་ཆེན་སྙིང་པོ་སུའི་དོན་གྱི་ཕྱིར་མཚན་མར་ལྟ་བ་འཛིན་པའི་འདུ་ཤེས་སྨྲ་བར་བྱེད།
en: Noble Great Cloud Essence, for whose benefit do you form this conception that apprehends things according to the view of signs?” “

source: སྨྲས་པ། སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པར་བྱ་བའི་ཕྱིར་རོ། །
en: It is in order to benefit all sentient beings.” “

source: སྨྲས་པ། གང་བདག་གི་ལྟ་བ་བསལ་བར་མི་ནུས་པ་དེས་གཞན་གྱི་ལྟ་བ་སེལ་བར་འགྱུར་བ་དེ་ནི་གནས་མེད་དོ།
en: It is unfounded to say that one who is incapable of removing their own view of self could remove others’ view of self.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། སྤྲིན་ཆེན་སྙིང་པོ་དེ་ནི་ལྷ་མོས་ཇི་སྐད་སྨྲས་པ་བཞིན་ཏེ།
en: The Bhagavān replied, “Great Cloud Essence, it is just as the goddess has said.

source: ཏིང་ངེ་འཛིན་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་གང་ཡིན་པ་དེ་ནི་མཚན་མ་མེད་པའི་འདུ་ཤེས་ཡང་དག་པར་མཐོང་བ་ཡིན་ནོ།
en: All bodhisattvas who abide in this samādhi see correctly according to the perception of signlessness.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་མཚན་མ་མ་མཆིས་པའི་འདུ་ཤེས་ཡང་དག་པར་བལྟ་བར་འཚལ་བས་ཇི་ལྟར་ཡང་དག་པར་བལྟ་བར་བགྱི།
en: Bhagavān, if noble sons or daughters—bodhisattvas who abide in this samādhi—wish to see correctly in line with the conception that signs do not exist, then how should they see correctly?” “

source: བཀའ་སྩལ་པ། སྤྲིན་ཆེན་སྙིང་པོ་ཏིང་ངེ་འཛིན་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་བདག་ཉིད་རྣམ་པ་དུ་མར་སྟོན་པར་བྱེད་དོ།
en: Great Cloud Essence, bodhisattvas who abide in this samādhi display many forms of themselves throughout the great trichiliocosm world-system.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཏིང་ངེ་འཛིན་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་བདག་ཉིད་རྣམ་པ་དུ་མར་ཇི་ལྟར་སྟོན་པར་བགྱིད།
en: Bhagavān, how do bodhisattvas who abide in this samādhi display many forms of themselves throughout the great trichiliocosm world-system?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། སྤྲིན་ཆེན་སྙིང་པོ་འདི་ལྟ་སྟེ། དཔེར་ན་སྒྱུ་མ་མཁན་ནམ། སྒྱུ་མ་མཁན་གྱི་སློབ་མ་ནན་ཏན་དུ་སྦྱངས་པ་མཁས་པས་རོལ་མོའི་ནང་དུ་བདག་ཉིད་རོར་གྱུར་པར་སྟོན་པར་བྱེད།
en: The Bhagavān replied, “To give an analogy, Great Cloud Essence, it is like an illusionist or an illusionist’s apprentice who, with skill developed through fervent training, displays himself transforming into a corpse amid great fanfare.

source: བུད་མེད་ཀྱི་ལུས་རྣམ་པ་སྣ་ཚོགས་སུ་ཡང་སྟོན་པར་བྱེད། གཅན་གཟན་གྱིས་ཟིན་པ་དང་། ལུས་ཞུ་བ་དང་། ལུས་མི་སྣང་བ་དང་། ཚིག་པ་དང་། བཅད་པ་དང་།
en: He also displays himself transforming into various female forms, being captured by wild animals, and with his body melting, disappearing, or being burned, cut, or chopped up.

source: གཏུབ་པའི་རྣམ་པས་ཕ་རོལ་འདྲིད་པ་ལྟ་བུར་གསང་བ་རྣམ་པ་སྣ་ཚོགས་ཀྱི་ཚུལ་དུ་བདག་ཉིད་སྟོན་པ་དག་ཀྱང་མཐོང་ན། དེར་རྒྱུས་ཤེས་པའི་མིས་འཇིགས་པར་མི་བྱ།
en: With these forms he is capable of deceiving outsiders, yet when his displays are seen by those who are familiar with the ways in which these various forms are produced through secret methods, those people will not become fearful or unhappy.

source: མྱ་ངན་དུ་མི་བྱ་བར་དེ་ལ་རིག་སྔགས་ཀྱི་རང་བཞིན་དུ་བལྟ་བར་བྱའོ།
en: They will see those apparitions as endowed with the self-nature of knowledge-mantras. “

source: །དེ་བཞིན་དུ་ཏིང་ངེ་འཛིན་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྟག་པ་ཉིད་ཀྱི་ལམ་ལ་ནན་ཏན་དུ་སྦྱངས་པས་སེམས་ཅན་རྣམས་ངེས་པར་བསྒྲལ་བའི་ཕྱིར་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདིར་བདག་ཉིད་རྣམ་པ་སྣ་ཚོགས་ཀྱི་ཚུལ་དུ་སྟོན་པར་བྱེད་དེ།
en: In similar fashion, bodhisattvas who abide in this samādhi, with fervent training on the path of permanence, display themselves in various forms throughout the great trichiliocosm world-system in order to liberate sentient beings.

source: ཏིང་ངེ་འཛིན་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་བདག་ཉིད་རྣམ་པ་སྣ་ཚོགས་ཀྱི་ཚུལ་དུ་སྟོན་པ་མཐོང་ན། བསྟན་པའི་རྒྱུས་ཤེས་ཤིང་མཁས་པས་སྐྲག་པར་མི་བྱ། ཀུན་ཏུ་སྐྲག་པར་མི་བྱ། དངང་བར་མི་བྱ། འཇིགས་པར་མི་བྱ།
en: Seeing bodhisattvas who abide in this samādhi display themselves in various forms, those who are familiar with and skilled in these displays will not become afraid, frightened, terrified, fearful, or unhappy.

source: མྱ་ངན་དུ་མི་བྱ་བར་དེ་ལ་སེམས་ཅན་རྟག་པ་ཉིད་ཀྱི་རང་བཞིན་དུ་བལྟ་བར་བྱའོ།
en: They will see those displays as endowed with the self-nature of the permanence of sentient beings. “

source: །སྤྲིན་ཆེན་སྙིང་པོ་གཞན་ཡང་ཏིང་ངེ་འཛིན་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་འཇིག་རྟེན་དང་འཐུན་པར་འཇུག་པའི་བྱ་བ་རྣམ་པ་གྲངས་མེད། དཔག་ཏུ་མེད་པ་བགྲང་བ་ལས་འདས་པ་རྣམ་པ་སྣ་ཚོགས་སུ་བདག་ཉིད་སྟོན་ཏོ།
en: Furthermore, Great Cloud Essence, bodhisattvas who abide in this samādhi display themselves in various forms throughout the great trichiliocosm world-system, and in these forms, they perform countless, unfathomable, innumerable activities that engage harmoniously with the world.

source: །འཛམ་བུའི་གླིང་བྱེ་བ་ཕྲག་སུམ་ཁྲི་དག་ཏུ་ཡང་གོང་མ་བཞིན་དུ་སྦྱར་རོ།
en: Again, they do so within three hundred billion Jambudvīpa continents.

source: །དེ་ལྟ་བུའི་ཚུལ་དུ་བྱེ་བ་ཕྲག་བརྒྱར་བསྒྲེ་བར་བྱ་སྟེ། གོང་མ་བཞིན་དུ་སྦྱར་རོ།
en: In similar fashion, they will grow old and again do so within one billion Jambudvīpa continents.” “

source: གསོལ་པ། བཅོམ་ལྡན་འདས་ཏིང་ངེ་འཛིན་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་འཇིག་རྟེན་དང་འཐུན་པར་འཇུག་པར་བྱ་བའི་རྣམ་པའི་གྲངས་མ་མཆིས་དཔག་ཏུ་མ་མཆིས་པ་རྣམ་པ་སྣ་ཚོགས་སུ་བདག་ཉིད་ཇི་ལྟར་སྟོན་པར་བགྱིད།
en: Bhagavān, in what manner do bodhisattvas who abide in this samādhi display themselves in various forms throughout the great trichiliocosm world-system and perform countless unfathomable activities that engage harmoniously with the world?” “

source: བཀའ་སྩལ་པ། ཏིང་ངེ་འཛིན་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔས་འཛམ་བུའི་གླིང་ལ་ལར་བདག་ཉིད་མངལ་ནས་སྐྱེ་བ་ལྟ་བུར་སྟོན་ཏེ།
en: Bodhisattvas who abide in this samādhi display themselves as appearing to be born from wombs in each and every Jambudvīpa continent, and sentient beings observe that these beings were born through childbirth.

source: སེམས་ཅན་རྣམས་ཀྱིས་བུ་བཙས་པར་ཤེས་ཀྱང་འཁྲིག་པ་ལ་བརྟེན་ནས་བྱུང་བ་ཡང་མ་ཡིན་ཞིང་བུའི་རང་བཞིན་ཡང་མ་ཡིན་ནོ།
en: Yet, these bodhisattvas were not produced through intercourse, and thus they do not possess the self-nature of children. “

source: །འཛམ་བུའི་གླིང་ལ་ལར་མངོན་པར་འབྱུང་བ་ཡང་སྟོན་ཏེ། སེམས་ཅན་རྣམས་ཀྱིས་མངོན་པར་འབྱུང་བར་ཤེས་ཀྱང་དེ་ལ་མངོན་པར་འབྱུང་བའི་འདུ་ཤེས་འཇུག་པ་ཡང་མེད་དོ།
en: In each and every Jambudvīpa continent, they display themselves as appearing to go forth to renunciation, and sentient beings observe that they went forth to renunciation. Yet, these bodhisattvas do not engage in the perception of going forth to renunciation.

source: །འཛམ་བུའི་གླིང་ལ་ལར་ནི་གཙུག་ཕུད་འབྲེག་པའི་ལས་ལྟ་བུར་སྟོན་ཏེ། སེམས་ཅན་རྣམས་ཀྱིས་གཙུག་ཕུད་འབྲེག་པའི་ལས་བྱེད་པར་ཤེས་ཀྱང་དེ་ལ་དེའི་འདུ་ཤེས་འཇུག་པ་ཡང་མེད་དོ།
en: They display themselves as appearing to perform the act of shaving their heads, and sentient beings observe that they have shaved their heads. Yet, these bodhisattvas do not engage in the conception of that. “

source: །འཛམ་བུའི་གླིང་ལ་ལར་ནི་མཁན་པོའི་ཁྱིམ་དུ་འགྲོ་བ་ལྟ་བུར་སྟོན་ཏེ།
en: In each and every Jambudvīpa continent, they display themselves as appearing to go to scholars’ houses to learn all the books to be studied, and sentient beings observe that.

source: བསླབ་པར་བྱ་བའི་ཡི་གེ་སློབ་པར་སེམས་ཅན་རྣམས་ཀྱིས་ཤེས་ཀྱང་བསྐལ་པ་དུ་མར་བསླབ་པའི་བྱ་བ་ཤིན་ཏུ་ཚར་ཕྱིན་པར་བྱས་ཤིང་། བསྐལ་པ་བྱེ་བ་ཕྲག་བརྒྱ་སྟོང་དུ་མ་ནས་བཟོའི་བྱ་བ་ཐམས་ཅད་ཀྱང་མཐར་ཕྱིན་ཏོ།
en: Yet, these bodhisattvas have already thoroughly completed their training over many eons and have brought all activities to fulfillment after many trillions of eons. “

source: །འཛམ་བུའི་གླིང་ལ་ལར་ནི་མིའི་སེང་གེ་དང་ངང་པའི་སྟབས་སུ་འགྲོ་བ་ལྟ་བུར་སྟོན་ཏེ། སེམས་ཅན་རྣམས་ཀྱིས་མིའི་སེང་གེ་དང་།
en: In each and every Jambudvīpa continent, they display themselves as appearing to go in the manner of geese and lions among humanity, and sentient beings observe them as going in the manner of geese and lions among humanity.

source: ངང་པའི་སྟབས་སུ་འགྲོ་བར་ཤེས་ཀྱང་བསྐལ་པ་བྱེ་བ་ཕྲག་དུ་མ་ལ་སོགས་པ་ནས་ངང་པའི་སྟབས་ཀྱི་འདུ་ཤེས་དེ་ཡང་སྤངས་སོ།
en: Yet, after many trillions of eons and so forth, these bodhisattvas have already abandoned the conception of them going in the manner of geese and lions. “

source: །འཛམ་བུའི་གླིང་ལ་ལར་ནི་བུ་དང་ཆུང་མ་ཡང་སྟོན་པར་བྱེད་དེ།
en: In each and every Jambudvīpa continent, they display themselves with children and spouses, and sentient beings observe them as engaging in desire.

source: སེམས་ཅན་རྣམས་ཀྱིས་འདོད་པ་ལ་ཡོངས་སུ་སྤྱོད་པར་ཤེས་ཀྱང་དེའང་རྟག་ཏུ་ཆོས་འདོད་པ་ལ་ཡོངས་སུ་སྤྱོད་ཀྱི་ཉོན་མོངས་པ་དང་འདོད་པ་ལ་གནས་པ་མ་ཡིན་ནོ།
en: Yet, although they do constantly and thoroughly engage in desire for the Dharma, these bodhisattvas do not abide in desire or afflictions. “

source: །འཛམ་བུའི་གླིང་ལ་ལར་ནི་བཤང་བ་དང་། གཅི་བ་ལྟ་བུར་སྟོན་པར་བྱེད་དེ། སེམས་ཅན་རྣམས་ཀྱིས་བཤང་བ་དང་།
en: In each and every Jambudvīpa continent, they display themselves as appearing to defecate and urinate, and sentient beings observe that they defecate and urinate.

source: གཅི་བ་བྱེད་པར་ཤེས་ཀྱང་བསྐལ་པ་བྱེ་བ་ཕྲག་གྲངས་མེད་པ་ནས་བཤང་བ་དང་གཅི་བའི་འདུ་ཤེས་ཀྱང་རྣམ་པར་སྤངས་ཏེ་འདུ་ཤེས་དེ་ཡང་འཇུག་པ་མེད་དོ།
en: Yet, after countless tens of millions of eons these bodhisattvas have abandoned the conceptions of defecating and urinating and do not engage in these conceptions. “

source: །འཛམ་བུའི་གླིང་ལ་ལར་ནི་ས་ཤིང་སྤྱོད་པ་ལྟ་བུར་སྟོན་ཏེ། སོ་ཤིང་འཆའ་བར་སེམས་ཅན་རྣམས་ཀྱིས་ཤེས་ཀྱང་བསྐལ་པ་བྱེ་བ་གྲངས་མེད་པ་ནས་ཉོན་མོངས་པའི་སོ་ཤིང་རྣམ་པར་སྤངས་ཏེ་ཁ་ཡང་ཨུད་པ་ལའི་དྲི་དང་ལྡན་ནོ།
en: In each and every Jambudvīpa continent, they display themselves as appearing to use tooth-cleaning sticks, and sentient beings observe them as chewing on tooth-cleaning sticks. Yet, after countless tens of millions of eons these bodhisattvas have completely abandoned the tooth-cleaning stick of the afflictions, and their mouths possess the fragrance of the utpala flower. “

source: །འཛམ་བུའི་གླིང་ལ་ལར་ནི་གདུགས་དང་། ལྷམ་འཆང་བ་ལྟ་བུར་སྟོན་ཏེ།
en: In each and every Jambudvīpa continent, they display themselves as appearing to hold parasols and wear shoes, and sentient beings observe that they hold parasols and wear shoes.

source: གདུགས་དང་ལྷམ་འཆང་བར་སེམས་ཅན་རྣམས་ཀྱིས་ཤེས་ཀྱང་བསྐལ་པ་བྱེ་བ་དུ་མ་ནས་ཉོན་མོངས་པའི་གདུགས་དང་ལྷམ་གྱི་འདུ་ཤེས་དེ་ཡང་རྣམ་པར་སྤངས་ཏེ།
en: Yet, after many tens of millions of eons these bodhisattvas have abandoned the conception of the parasols and shoes of the afflictions.

source: ལུས་དག་ཅིང་རྟག་ཏུ་ཆོས་ཀྱི་བདེ་བ་དང་ཏིང་ངེ་འཛིན་གྱི་གདུགས་འཆང་ཞིང་རིན་པོ་ཆེའི་གདུགས་དུ་མ་དང་པད་མའི་ལྷམ་ཐམས་ཅད་སྟོན་པར་བྱེད་དོ།
en: Their bodies are pure, and they constantly hold the parasols of samādhi and the joy of Dharma and display many jeweled parasols and shoes of lotus flowers. “

source: །འཛམ་བུའི་གླིང་ལ་ལར་ནི་ཁྲུས་བྱེད་པ་ལྟ་བུར་སྟོན་ཏེ།
en: In each and every Jambudvīpa continent, they display themselves as appearing to bathe, and sentient beings observe them bathing.

source: ཁྲུས་བྱེད་པར་སེམས་ཅན་རྣམས་ཀྱིས་ཤེས་ཀྱང་བསྐལ་པ་བྱེ་བ་ཕྲག་དུ་མ་ནས་ཁྲུས་ཀྱི་འདུ་ཤེས་དེ་རྣམ་པར་སྤངས་ཏེ།
en: Yet, after many tens of millions of eons these bodhisattvas have abandoned the conception of bathing.

source: མདོ་དུ་མ་ནས་བྱུང་བའི་ཆུས་རྟག་ཏུ་ཁྲུས་བྱེད་ཅིང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་མུ་སྟེགས་སུ་གྱུར་པ་ཡིན་ནོ།
en: They constantly bathe in the water of the Dharma that has arisen from the many discourses, with all sentient beings as the ghats [that lead to their bathing ponds]. “

source: །འཛམ་བུའི་གླིང་ལ་ལར་ནི་ནད་ཀྱི་རང་བཞིན་ལྟ་བུར་སྟོན་ཏེ། སྨན་ལ་སྟེན་པར་སེམས་ཅན་རྣམས་ཀྱིས་ཤེས་ཀྱང་བསྐལ་པ་བྱེ་བ་ཕྲག་དུ་མ་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་དང་བྲལ་ཞིང་ནད་རྣམས་བསལ་བ་སྟེ།
en: In each and every Jambudvīpa continent, they display themselves as appearing to be naturally susceptible to illness, and sentient beings observe them relying on medicines. Yet, after many tens of millions of eons these bodhisattvas are free from all afflictions and have cleared away all illnesses.

source: སེམས་ཅན་ནད་ཀྱིས་ཐེབས་པ་རྣམས་དང་འདོད་ཆགས་ཀྱི་རང་བཞིན་དག་ལས་ཀྱང་གསོ་བར་བྱེད་དོ།
en: Moreover, they cure those sentient beings who have been struck by illness and who are naturally susceptible to desire. “

source: །འཛམ་བུའི་གླིང་ལ་ལར་ནི་གྲང་བ་དང་ཚ་བ་ལ་སྟེན་པ་ལྟ་བུར་སྟོན་ཏེ། གྲང་བ་དང་ཚ་བ་ལ་སྟེན་པར་སེམས་ཅན་རྣམས་ཀྱིས་ཤེས་ཀྱང་བསྐལ་པ་བྱེ་བ་ཕྲག་དུ་མ་ལ་སོགས་པ་ནས་གྲང་བ་དང་ཚ་བའི་འཇིགས་པ་ཡང་རྣམ་པར་སྤངས་སོ།
en: In each and every Jambudvīpa continent, they display themselves as susceptible to cold and heat, and sentient beings observe them as susceptible to cold and heat. Yet, after many tens of millions of eons these bodhisattvas have abandoned all fear of cold and heat. “

source: །འཛམ་བུའི་གླིང་ལ་ལར་ནི་བཀྲེས་པ་དང་སྐོམ་པས་སྲེད་ཅིང་ཞེན་པ་དང་ལྡན་པར་སྟོན་ཏེ། བཀྲེས་ཤིང་སྐོམ་པས་གདུངས་པར་སེམས་ཅན་རྣམས་ཀྱིས་ཤེས་ཀྱང་བསྐལ་པ་བྱེ་བ་ཕྲག་དུ་མ་ནས་བཀྲེས་པ་དང་སྐོམ་པའི་འདུ་ཤེས་ཀྱིས་འཇིགས་པའི་ཀླུང་གི་རྒྱུན་ལས་ཀྱང་རྒལ་ནས་རྟག་ཏུ་བཀྲེས་པ་དང་སྐོམ་པས་སྲེད་པར་གྱུར་པའི་འབྱུང་པོ་ཐམས་ཅད་ཀྱི་ཁ་ཟས་སུ་གྱུར་ཅིག་ཅེས་ཟེར་རོ།
en: In each and every Jambudvīpa continent, they display themselves as becoming afflicted with craving and clinging due to hunger and thirst, and sentient beings observe them as suffering hunger and thirst. Yet, after many tens of millions of eons, these bodhisattvas have crossed over the flowing river of fear due to the conception of hunger and thirst, and having done so they constantly conjure up food for those spirits afflicted by hunger and thirst, saying ‘Let there be food!’ “

source: །འཛམ་བུའི་གླིང་ལ་ལར་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྤྱོད་པ་ལ་རྩོམ་པ་ལྟ་བུར་སྟོན་ཏེ།
en: In each and every Jambudvīpa continent, they display themselves as undertaking the practice of the perfection of generosity, and sentient beings observe this, thinking,

source: ཀྱེ་མ་སྦྱིན་པ་ལ་བརྩོན་པའི་སེམས་ཅན་ཡིན་པར་སེམས་ཅན་རྣམས་ཀྱིས་ཤེས་ཀྱང་བསྐལ་པ་བྱེ་བ་ཕྲག་དུ་མ་ནས་ཀྱང་ཕ་རོལ་ཏུ་ཕྱིན་པ་དུ་མ་རྟག་ཏུ་སྤྱད་པས་ཕ་རོལ་ཏུ་ཕྱིན་པ་བཅུ་པོ་རྣམས་ལ་སེམས་ཅན་རྣམས་སྡུད་པའི་རྒྱུར་གྱུར་ཏོ།
en: ‘Ah! They are sentient beings exerting themselves in generosity.’ Yet, over many tens of millions of eons, these bodhisattvas have constantly practiced the various perfections, and as a result they have become primary causes for sentient beings’ accumulation of the ten perfections.

source: །འཛམ་བུའི་གླིང་ལ་ལར་ནི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་སྲིད་ཀྱི་ཚུལ་སྟོན་ཏེ། འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་སེམས་ཅན་རྣམས་ཀྱིས་ཤེས་ཀྱང་དེ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ཕལ་གྱི་སྤྱད་པ་ཡང་མི་སྤྱོད་དེ།
en: In each and every Jambudvīpa continent, they display themselves in the manner of cakravartin kings, and sentient beings observe them as cakravartin kings, yet they do not engage in the conduct of ordinary cakravartin kings.

source: རྟག་ཏུ་ཕྱིར་མི་ལྡོག་པའི་ཆོས་ཀྱི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་བྱེད་ཅིང་སེམས་ཅན་ཐམས་ཅད་ཀྱང་བྱེད་དུ་འཇུག་གོ།
en: Rather, they constantly act as kings who turn the wheel of the incontrovertible Dharma, and they enable all sentient beings to do the same. “

source: །འཛམ་བུའི་གླིང་ལ་ལར་ནི་དེ་ལྟ་བུའི་རྒྱལ་སྲིད་ཕུན་སུམ་ཚོགས་པ་ཤིན་ཏུ་རྒྱ་ཆེ་བ་དག་ཀྱང་རྩྭ་བཞིན་དུ་བོར་ནས་རབ་ཏུ་བྱུང་བའི་གཟུགས་དང་མཚན་མ་སྟོན་པར་བྱེད་དེ། ལ་ལར་ནི་རབ་ཏུ་བྱུང་བ་ལྟ་བུ། ལ་ལར་ནི་རབ་ཏུ་མ་བྱུང་བ་ལྟ་བུར་སེམས་ཅན་རྣམས་ཀྱིས་ཤེས་སོ།
en: In each and every Jambudvīpa continent, they display themselves with the form and characteristics of one who goes forth having discarded a perfect and vast kingdom as if it were so much dry grass. In each and every one, they seem not to have gone forth to renunciation, and in each and every one, sentient beings observe them as not having gone forth to renunciation. “

source: །འཛམ་བུའི་གླིང་ལ་ལར་ནི་ཡ་མཚན་ཅན་ཐམས་ཅད་ཀྱི་རབ་ཏུ་བྱུང་བ་ལྟ་བུར་ལྟ་བ་ངན་པ་རབ་ཏུ་འབྱུང་བ་ལ་རབ་ཏུ་བྱུང་བར་སེམས་ཅན་རྣམས་ཀྱིས་ཤེས་ཀྱང་ཡ་མཚན་ཅན་ཐམས་ཅད་འཐུན་པར་རབ་ཏུ་བྱུང་བ་ཡང་མ་ཡིན་ཏེ་དེ་དག་ངེས་པར་བསྒྲལ་བའི་ཕྱིར་རབ་ཏུ་འབྱུང་ངོ་།
en: In each and every Jambudvīpa continent, they display themselves as non-Buddhist renunciants who have gone forth to renunciation with false views, and sentient beings observe them as renunciants. Yet it is not the case that they have become renunciants who subscribe to non-Buddhist doctrines. Rather, they have gone forth to renunciation in order to liberate those non-Buddhist renunciants. “

source: །འཛམ་བུའི་གླིང་ལ་ལར་ནི་དེ་བཞིན་གཤེགས་པ་རབ་ཏུ་འབྱུང་བར་རྩོམ་པ་ལྟ་བུར་སྟོན་ཏེ། དེ་བཞིན་གཤེགས་པ་རབ་ཏུ་འབྱུང་བས་རབ་ཏུ་འབྱུང་བར་སེམས་ཅན་རྣམས་ཀྱིས་ཤེས་ཀྱང་།
en: In each and every Jambudvīpa continent, they display themselves first going forth to renunciation as the Tathāgata, and sentient beings observe them as having gone forth to renunciation as the Tathāgata.

source: བསྐལ་པ་བྱེ་བ་ཕྲག་དུ་མ་ནས་དེ་བཞིན་གཤེགས་པའི་རབ་ཏུ་འབྱུང་བའི་བྱ་བ་ཡང་མཐར་ཕྱིན་པར་བྱས་སོ།
en: Yet, over many tens of millions of eons, these bodhisattvas have already fulfilled the activity of the Tathāgata’s going forth to renunciation. “

source: །འཛམ་བུའི་གླིང་ལ་ལར་ནི་སྦྱངས་པའི་ཡོན་ཏན་བཅུ་གསུམ་ཡང་དག་པར་འཛིན་པ་ལྟ་བུར་སྟོན་ཏེ། སྦྱངས་པའི་ཡོན་ཏན་ཅན་ཡོ་བྱད་བསྙུངས་པ་ཡིན་པར་སེམས་ཅན་རྣམས་ཀྱིས་ཤེས་ཀྱང་།
en: In each and every Jambudvīpa continent, they display themselves as correctly observing the twelve austerities, and sentient beings observe them as ascetics who engage in austerities.

source: བསྐལ་པ་བྱེ་བ་ཕྲག་དུ་མ་ནས་སྦྱངས་པའི་ཡོན་ཏན་རྫོགས་ཤིང་རྟག་ཏུ་མཉམ་པར་བཞག་པ་ཡང་ཡིན་ནོ།
en: Yet, over many tens of millions of eons, these bodhisattvas have already completed the austerities, and they constantly abide in equipoise. “

source: །འཛམ་བུའི་གླིང་ལ་ལར་ནི་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་རྩྭ་བཏིང་བ་ལ་འདུག་པ་ལྟ་བུར་སྟོན་ཏེ། བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་པར་སེམས་ཅན་རྣམས་ཀྱིས་ཤེས་ཀྱང་།
en: In each and every Jambudvīpa continent, they display themselves as sitting on a grass mat at the seat of awakening, and sentient beings observe them as sitting at the seat of awakening.

source: རྟག་ཏུ་བྱང་ཆུབ་ཀྱི་བྱ་བ་མཐར་ཕྱིན་པར་བྱས་པ་ཡང་ཡིན་ནོ།
en: Yet these bodhisattvas are constantly engaged in fulfilling the activities of awakening. “

source: །འཛམ་བུའི་གླིང་ལ་ལར་ནི་བསམ་གཏན་དང་ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པ་ལ་སྙོམས་པར་ཞུགས་པ་ལྟ་བུར་སྟོན་ཏེ། བསམ་གཏན་དང་། ཏིང་ངེ་འཛིན་དང་།
en: In each and every Jambudvīpa continent, they display themselves as engaging in meditative absorption, samādhi, and equanimity, and sentient beings observe them as engaging in meditative absorption, samādhi, and equanimity.

source: སྙོམས་པར་འཇུག་པ་ལ་སྙོམས་པར་ཞུགས་པར་སེམས་ཅན་རྣམས་ཀྱིས་ཤེས་ཀྱང་རྟག་ཏུ་སྙོམས་པར་འཇུག་པའི་སྤྱོད་པ་དུ་མ་ལ་སྤྱོད་པ་ཡང་ཡིན་ནོ།
en: Yet, these bodhisattvas are constantly practicing the many practices of engaging in equanimity. “

source: །འཛམ་བུའི་གླིང་ལ་ལར་ནི་ཡན་ལག་དགུ་པའི་མདོ་འཆད་པ་ལྟ་བུར་སྟོན་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་ཡན་ལག་དགུ་པའི་མདོ་གསུངས་པ་འཆད་པར་སེམས་ཅན་རྣམས་ཀྱིས་ཤེས་ཀྱང་རྟག་ཏུ་མདོ་དུ་མ་ལ་སོགས་པ་ཡང་འཆད་དོ།
en: In each and every Jambudvīpa continent, they display themselves as explaining the nine categories of discourses, and sentient beings observe them as the Bhagavān explaining the speech of the nine categories of discourses. Yet, these bodhisattvas are constantly explaining all the various categories of discourses. “

source: །འཛམ་བུའི་གླིང་ལ་ལར་ནི་བསླབ་པའི་གཞིའི་ཚད་ངེས་པར་བྱེད་པ་ལྟ་བུར་སྟོན་ཏེ། བསླབ་པའི་གཞིའི་ཚད་ངེས་པར་འཆའ་བར་བྱེད་པར་སེམས་ཅན་རྣམས་ཀྱིས་ཤེས་ཀྱང་།
en: In each and every Jambudvīpa continent, they display themselves as definitively attaining the full measure of the basic precepts, and sentient beings observe them as possessing the full measure of the basic precepts.

source: ཆོས་ཀྱི་ཕུང་པོ་བརྒྱད་ཁྲི་བཞི་སྟོང་གི་མདོ་དག་ཀྱང་རྟག་ཏུ་བྱེད་ཅིང་། བསླབ་པའི་གཞི་དུ་མ་དག་ཀྱང་རྟག་ཏུ་འཆའ་བར་བྱེད་དོ།
en: Yet, these bodhisattvas are constantly engaged in the various discourses belonging to the eighty-four thousand divisions of the Dharma and are constantly upholding all the various basic precepts. “

source: །འཛམ་བུའི་གླིང་ལ་ལར་ནི་བྱང་ཆུབ་ཀྱི་ཤིང་དྲུང་དུ་བདུད་འདུལ་བ་ལྟ་བུར་སྟོན་ཏེ། བདུད་ཀྱི་སྡེ་ཕམ་པར་བྱས་པར་སེམས་ཅན་རྣམས་ཀྱིས་ཤེས་ཀྱང་།
en: In each and every Jambudvīpa continent, they display themselves as subduing Māra at the base of the Bodhi tree, and sentient beings observe them as having defeated the armies of Māra.

source: བདུད་ཀྱི་འདུ་ཤེས་གཅིག་ཀྱང་མི་འབྱུང་སྟེ། ཉོན་མོངས་པའི་བདུད་དང་། ཕུང་པོའི་བདུད་ལ་སོགས་པ་བདུད་བྱེ་བ་ཕྲག་དུ་མ་དག་ཀྱང་རྟག་ཏུ་ཟད་པར་བྱེད་དོ།
en: Yet, these bodhisattvas do not give rise to the conception of Māra and have permanently eliminated all the many tens of millions of māras such as the māra of the afflictions, the māra of the aggregates, and so forth. “

source: །འཛམ་བུའི་གླིང་ལ་ལར་ནི་རྒྱུན་ཏུ་ཞུགས་པའི་འབྲས་བུ་ལ་སོགས་པ་འབྲས་བུ་བཞི་ཐོབ་པ་ལྟ་བུར་སྟོན་ཏེ།
en: In each and every Jambudvīpa continent, they display themselves as attaining the four fruitions, such as the fruition of stream entry and so forth, and sentient beings observe them as having attained the four fruitions.

source: འབྲས་བུ་བཞི་ཐོབ་པར་སེམས་ཅན་རྣམས་ཀྱིས་ཤེས་ཀྱང་འབྲས་བུ་བཞིའི་འདུ་ཤེས་ཀྱང་མི་འབྱུང་སྟེ།
en: Yet, these bodhisattvas do not give rise to the conception of the four fruitions.

source: འབྲས་བུའི་བྱ་བ་དུ་མ་དག་ལ་ཡང་སྤྱོད་ཅིང་ཕྱིར་མི་འོང་བ་ཡང་མ་ཡིན་ལ། སེམས་ཅན་རྣམས་ངེས་པར་བསྒྲལ་བའི་ཕྱིར་རྟག་ཏུ་སྲིད་པའི་ཡན་ལག་རྣམས་སུ་ཡང་འོང་ངོ་།
en: Since they conduct themselves in all the various fruitional activities but have not become non-returners, they are constantly reentering the links of conditioned existence in order to liberate all sentient beings. “
